In [1]:
import pandas as pd

In [2]:
df = pd.read_csv('raw_data/happinessdata.csv')
df

,LOCATION,TIME,Life satisfaction in Cantril Ladder (World Happiness Report 2019),Unnamed: 3,Unnamed: 4,Unnamed: 5,Unnamed: 6,Unnamed: 7,Unnamed: 8,Code,Year,Life satisfaction in Cantril Ladder (World Happiness Report 2019).1,Unnamed: 12,Unnamed: 13,Unnamed: 14,Unnamed: 15,Unnamed: 16,Unnamed: 17,Unnamed: 18,Unnamed: 19
0,AFG,1960,NaN,NaN,NaN,NaN,NaN,NaN,NaN,AFG,2008.0,3.723590,NaN,NaN,NaN,NaN,NaN,NaN,NaN,1960.0
1,AFG,1961,NaN,NaN,NaN,NaN,NaN,NaN,NaN,AFG,2009.0,4.401778,NaN,NaN,NaN,NaN,NaN,NaN,NaN,1961.0
2,AFG,1962,NaN,NaN,NaN,NaN,NaN,NaN,NaN,AFG,2010.0,4.758381,NaN,NaN,NaN,NaN,NaN,NaN,NaN,1962.0
3,AFG,1963,NaN,NaN,NaN,NaN,NaN,NaN,NaN,AFG,2011.0,3.831719,NaN,NaN,NaN,NaN,NaN,NaN,NaN,1963.0
4,AFG,1964,NaN,NaN,NaN,NaN,NaN,NaN,NaN,AFG,2012.0,3.782938,NaN,NaN,NaN,NaN,NaN,NaN,NaN,1964.0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
16099,WLD,2016,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
16100,WLD,2017,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
16101,WLD,2018,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
16102,WLD,2019,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
16103,WLD,2020,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [3]:
df1 = df[['LOCATION','TIME']]
df2 = df[['Code','Year','Life satisfaction in Cantril Ladder (World Happiness Report 2019).1']]

In [8]:
df1.dropna(inplace=True)
df2.dropna(inplace=True)

In [9]:
df2

,Code,Year,Life satisfaction in Cantril Ladder (World Happiness Report 2019).1
0,AFG,2008.0,3.723590
1,AFG,2009.0,4.401778
2,AFG,2010.0,4.758381
3,AFG,2011.0,3.831719
4,AFG,2012.0,3.782938
...,...,...,...
1699,ZWE,2014.0,4.184451
1700,ZWE,2015.0,3.703191
1701,ZWE,2016.0,3.735400
1702,ZWE,2017.0,3.638300
1703,ZWE,2018.0,3.616480

In [10]:
df1

      LOCATION  TIME
0          AFG  1960
1          AFG  1961
2          AFG  1962
3          AFG  1963
4          AFG  1964
...        ...   ...
16099      WLD  2016
16100      WLD  2017
16101      WLD  2018
16102      WLD  2019
16103      WLD  2020

[16104 rows x 2 columns]

In [11]:
df1.columns

Index(['LOCATION', 'TIME'], dtype='object')

In [13]:
df1 = df1.rename(columns={'TIME':'Year','LOCATION':'Code'})
df1

      Code  Year
0      AFG  1960
1      AFG  1961
2      AFG  1962
3      AFG  1963
4      AFG  1964
...    ...   ...
16099  WLD  2016
16100  WLD  2017
16101  WLD  2018
16102  WLD  2019
16103  WLD  2020

[16104 rows x 2 columns]

In [18]:
df2['Year']=df2['Year'].astype("int")

In [19]:
df2

,Code,Year,Life satisfaction in Cantril Ladder (World Happiness Report 2019).1
0,AFG,2008,3.723590
1,AFG,2009,4.401778
2,AFG,2010,4.758381
3,AFG,2011,3.831719
4,AFG,2012,3.782938
...,...,...,...
1699,ZWE,2014,4.184451
1700,ZWE,2015,3.703191
1701,ZWE,2016,3.735400
1702,ZWE,2017,3.638300
1703,ZWE,2018,3.616480

In [22]:
df1.dtypes

Code    object
Year     int64
dtype: object

In [25]:
merge = pd.merge(df1, df2, on=['Code','Year'], how='left')
merge

,Code,Year,Life satisfaction in Cantril Ladder (World Happiness Report 2019).1
0,AFG,1960,NaN
1,AFG,1961,NaN
2,AFG,1962,NaN
3,AFG,1963,NaN
4,AFG,1964,NaN
...,...,...,...
16099,WLD,2016,NaN
16100,WLD,2017,NaN
16101,WLD,2018,NaN
16102,WLD,2019,NaN
16103,WLD,2020,NaN

In [27]:
merge1 = merge.fillna(0)
merge1

,Code,Year,Life satisfaction in Cantril Ladder (World Happiness Report 2019).1
0,AFG,1960,0.0
1,AFG,1961,0.0
2,AFG,1962,0.0
3,AFG,1963,0.0
4,AFG,1964,0.0
...,...,...,...
16099,WLD,2016,0.0
16100,WLD,2017,0.0
16101,WLD,2018,0.0
16102,WLD,2019,0.0
16103,WLD,2020,0.0

In [28]:
merge1[merge1['Code']=='AFG']

,Code,Year,Life satisfaction in Cantril Ladder (World Happiness Report 2019).1
0,AFG,1960,0.000000
1,AFG,1961,0.000000
2,AFG,1962,0.000000
3,AFG,1963,0.000000
4,AFG,1964,0.000000
...,...,...,...
56,AFG,2016,4.220169
57,AFG,2017,2.661718
58,AFG,2018,2.694303
59,AFG,2019,0.000000
60,AFG,2020,0.000000